---
kind: property
id: P:Autodesk.Revit.DB.Electrical.WireSet.Size
source: html/3b5dda8c-f9a9-683c-959c-789e454978ab.htm
---
# Autodesk.Revit.DB.Electrical.WireSet.Size Property

Returns the number of objects that are in the set.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```